import matplotlib.pyplot as plt
import os

# Данные
array_sizes = [0,50000, 100000,150000,200000,300000,400000,500000,600000,700000,800000,900000,1000000,1200000,1300000,1500000,1700000,1900000,2000000, 2250000,2500000,2750000,3000000, 3250000,3500000,3750000,4000000]

# Различные времена для разных наборов данных
avg_times_1 = [0.0000003,0.0552457,0.1158131,0.184742,0.2500927,0.436423,0.6491579,0.7741016,0.9579843,1.1121512,1.335848,1.6065928,1.739834,2.0977989,2.2920781,2.7071156,3.1534949,3.7632044,3.7714618,4.270667,4.961658,5.5044966,5.9800275,6.6829736,6.5025039,7.379328,7.8456392


]
avg_times_2 = [0.0000002,0.0339119,0.0652478,0.0976201,0.132175,0.2020698,0.272635,0.34421,0.4180782,0.4901688,0.5674852,0.6383142,0.7132636,0.9068205,0.948827,1.10646,1.250639,	1.425564,1.535688,1.7383195,1.9280191,2.1192249,2.3084321,2.5063738,2.6978516,2.9022107,3.1020236



]
avg_times_3 = [0.0000004,0.0366918,0.074428,0.114219,0.1521484,0.2372374,0.3363454,0.4297831,0.5235246,0.6269939,0.7307331,0.8937392,1.0653577,1.2554791,1.3138986,1.4723626,1.6759412,1.8630235,1.9868668,2.3679078,2.5849039,2.9006621,3.1894042,3.3820121,3.8957904,4.4619875,5.059827


]
avg_times_4 = [0.0000003,0.0346396,0.0656125,0.1021419,0.1363544,0.2106571,0.2823551,0.3553976,0.4375892,0.5096671,0.5802942,0.6558114,0.7512774,0.9586402,0.9649035,1.1210539,1.2864148,1.4539253,1.5205204,1.7226764,1.9201104,2.1156977,2.4183715,2.5530663,2.7832484,2.9837203,3.148418



]

#Построение графиков
plt.plot(array_sizes, avg_times_1, '-^', linewidth=2, label='Случайные данные')
plt.plot(array_sizes, avg_times_2, '-o', linewidth=2, label='Отсортированные данные')
plt.plot(array_sizes, avg_times_3, '-s', linewidth=2, label='Частично отсортированные данные')
plt.plot(array_sizes, avg_times_4, '-d', linewidth=2, label='Полностью отсортированные в обратном порядке данные')

# Подписи осей
plt.xlabel('Array Size')
plt.ylabel('Avg Time (Seconds)')

# Добавление сетки и легенды
plt.grid(True)
plt.legend()

# Заголовок графика
plt.title('Время выполнения в зависимости от размера массива для разных типов данных')

#Показать график

plt.savefig(os.path.join(r"C:\Users\user\PycharmProjects\graphik\graphiki", "fast_sort.png"))
plt.show()
#print(len(array_sizes),' ',len(avg_times_1),' ',len(avg_times_2),' ',len(avg_times_3),' ',len(avg_times_4))